/* Фантастика */
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Аватар',
    'Действие фильма происходит в будущем, на очень далекой и удивительной планете Пандора, где крупная корпорация RDA занимается добычей очень дорогостоящего минерала анобтаниум. На планете так же обитает местное население гуманоидов на’ви, которые очень сильно чтят окружающую природу. Правда, местные аборигены очень сильно мешают добыче минерала, да и ко всему прочему их поселение находится на самых крупных залежах анобтаниума. Для того, чтобы найти общий язык с на’ви, корпорация спонсирует программу по разработке аватаров - искусственно созданных тел гуманоидов, управляемых людьми, на основе ДНК которых они были созданы.',
    2009,
    1, 12, 179, 1
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Дюна',
    'Фильм, основанный на одноимённом фантастическом романе Френка Герберта, расскажет историю Пола Атрейдеса — талантливого молодого человека,',
    2021,
    1, 12, 155, 2
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Грань будущего',
    'Агрессивная инопланетная раса, превосходящая людей в уровне технологического развития, нападает на Землю, обрекая человечество на борьбу за собственное существование. Лондон становится последним пристанищем выживших людей, пока генерал Бригам планирует атаку на территорию Франции, надеясь победить жестоких захватчиков.',
    2014,
    1, 12, 113, 3
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Я – легенда',
    'Весь мир ликует, ведь ученым удалось найти долгожданное лекарство от рака. Но в скором времени радость сменяет ужас, потому что лекарство оказывается страшным вирусом, вырвавшимся на свободу.',
    2007,
    1, 16, 101, 4
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Начало',
    'Сюжет картины рассказывает о ворах, способных украсть идею прямо у человека из подсознания.',
    2010,
    1, 12, 148, 5
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Области тьмы',
    'Писатель Эдди переживает творческий кризис, кроме того у него проблемы в личной жизни. Однако он мечтает о роскошной жизни. Однажды ему предоставляется возможность с помощью чудодейственных таблеток, повышающих эффективность мозга, добиться всего, чего он желает.',
    2011,
    1, 18, 106, 6
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Бездна',
    'Американская подводная атомная лодка с несколькими баллистическими ракетами на борту сталкивается с неизвестным объектом, вследствие чего получает сильнейший удар, который приводит к поломке системы. Лодка бьется о скалы и начинает медленно погружаться на дно. Весь экипаж корабля остается блокированным внутри, не имея возможности спастись самостоятельно.',
    1989,
    1, 16, 171, 7
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Эффект бабочки',
    'Главный герой фильма Эван с самого детства страдал кратковременными потерями памяти. Психиатр, которого он посещал, дал ему совет вести дневник, и записывать туда все происходящее. Однажды, спустя много лет, когда Эван стал взрослым, ему на глаза попадают старые дневники, и он решает их перечитать. Читая их один за другим, парень начинает осознавать, что посещающие его спонтанные видения, это далеко не просто наплывы воспоминаний.',
    2004,
    1, 16, 113, 8
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Пятый элемент',
    'Действия картины разворачиваются в будущем. Над землей нависла угроза полного уничтожения: на большой скорости к ней приближается огромный огненный шар, являющийся воплощением абсолютного зла. Все попытки военных уничтожить объект заканчиваются неудачей, и приводят лишь к тому, что он увеличивается в размерах. В скором времени выясняется, что его можно уничтожить только лишь с помощью пяти элементов, четыре из которых представляют основные стихии земли, а пятый, основной, идеальное существо.',
    1997,
    1, 16, 126, 9
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Матрица',
    'Томас Андерсон ведет двойную жизнь. Днем он работает техническим специалистом по компьютерному софту, а ночью становится гениальным хакером, известным как Нео. Однажды ночью Нео встречает Тринити — таинственную женщину, которая приводит его к Морфеусу.',
    1999,
    1, 16, 136, 10
);

/* Ужасы */
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    '28 дней спустя',
    'Группа защитников животных врывается в лабораторию исследовательского центра и освобождает одну из содержащихся там обезьян, однако животное, оказавшееся инфицированным вирусом неудержимой агрессии, набрасывается на людей. Двадцать восемь дней спустя лондонский курьер Джим выходит из комы и обнаруживает, что в городе царит хаос.',
    2002,
    2, 16, 113, 11
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Чужой',
    'Во время возвращения домой, космический корабль под названием «Ностромо» получает с одной из планет неопознанный сигнал. Не сумев его опознать, но классифицировав, как просьбу о помощи, бортовой компьютер корабля решает пробудить из анабиоза весь экипаж корабля, погруженный в сон на время длительного путешествия.',
    1979,
    2, 16, 116, 12
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Пункт назначения',
    'Парень по имени Алекс летит в школьное путешествие в Париж. Он очень боится летать, и перед самым взлетом у него случается видение, что самолет потерпит крушение, и все погибнут. У парня начинается паника, и он пытается покинуть самолет. В связи со сложившейся ситуацией Алекса вместе с еще несколькими друзьями высаживают, чтобы дать парню успокоиться и посадить всю компанию на следующий рейс. Тот самолёт, на котором ребята собирались лететь, покидает аэропорт, и на следующий день становится известно, что он потерпел крушение, как и предвидел Алекс.',
    2000,
    2, 16, 98, 13
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Обитель зла',
    'В центре сюжета молодая девушка Элис, которая вместе с отрядом спецназа оказывается в секретной подземной лаборатории крупной корпорации Umbrella. Незадолго до этого, неизвестный попытался украсть из лаборатории секретный вирус, однако ему это не удалось, но он умудрился разбить колбу с опасным веществом. Чтобы не допустить эпидемии, компьютер, отвечающий за безопасность, устраняет всех работников лаборатории, и активирует режим карантина.',
    2002,
    2, 18, 100, 14
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Пила: Игра на выживание',
    'В одном темном и жутком подвале оказались два незнакомых друг другу человека. На середине комнаты лежал труп мужчины, третий мужчина. Было прекрасно видно, что у него прострелена голова. В руке мертвеца находился пистолет. Главные же герои оказались прикованными к холодным стенам цепями. Как они оказались в данном месте мужчины не могли ответить.',
    2004,
    2, 18, 103, 15
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Изгоняющий дьявола',
    'Изгоняющий дьявола (The Exorcist) - невероятно популярная, ставшая неким каноном жанра история, повествующая об одной семье – известной актрисе и ее дочери, которая, как полагает ее мать, пережила личную трагедию и, как потом подтверждают врачи, получила сильную психологическую травму, вследствие чего девочка начинает вести себя неадекватным образом. Обеспокоенная мать, которой не помогли врачи, решает позвать священника, который выносит жуткий вердикт – девочка одержима.',
    1973,
    2, 16, 122, 16
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Мгла',
    'Когда на маленький городок, расположенный в штате Мэн, после сильного шторма опускается плотный туман, группа людей, среди которых находится художник Дэвид Дрейтон и его 5-летний сын, оказывается в ловушке в местном продуктовом магазине. Вскоре жителям удается обнаружить, что странный туман является прикрытием для появления множества ужасных существ, которые проникли на Землю через межпространственный разрыв, вызванный деятельностью соседней военной базы.',
    2007,
    2, 18, 126, 17
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Омен',
    'На первый взгляд у Роберта и Кэтрин Торн есть все. Они счастливо женаты, а Роберт является послом США в Великобритании, но супружеская пара очень хочет детей. Когда у Кэтрин появляется мертворожденный ребенок, в больнице к Роберту обращается священник, который предлагает дипломату усыновить здорового новорожденного малыша. Ничего не сказав жене, мужчина соглашается взять ребенка. После приезда домой, странные события и зловещие предупреждения священника заставляют поверить Роберта Торна в то, что ребенок, которого он усыновил, является воплощением зла.',
    1976,
    2, 18, 111, 18
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Сияние',
    'В основу сюжета лег культовый бестселлер американского писателя Стивена Кинга. В центре сюжета находится Джек Торранс — писатель-неудачник, который устраивается на работу привратником роскошной гостиницы, куда привозит семью. Когда менеджер гостиницы сообщает, что предыдущий привратник и его семья были жестоко убиты, Джек не обращает внимания, однако Дэнни, мальчик-экстрасенс с развитым альтер-эго по имени Тони, чувствует, что здание хранит множество ужасных тайн.',
    1980,
    2, 16, 144, 19
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Нечто',
    'Сотрудники американской исследовательской станции, расположенной в Антарктиде, становятся невольными свидетелями загадочного поведения своих норвежских коллег. Те буквально с маниакальным упорством преследуют одинокую собаку, намереваясь застрелить её из винтовки. Став на защиту животного, американцы пытаются разобраться в столь странной ситуации и выяснить причины этого таинственного происшествия. Но чем больше они узнают, тем отчетливее понимают – они столкнулись с чем-то не только неведомым, но и смертельно опасным…',
    1982,
    2, 16, 109, 20
);

/* Комедии */
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Назад в будущее',
    'Марти Макфлай – обычный американский подросток из Калифорнии. Его слабохарактерный отец Джордж постоянно подвергается насмешкам и издевательствам начальник Биффа Таннена, мать парня страдает депрессией и ожирением, а его старшие братья и сестры – классические неудачники. Однажды ночью 1985 года парень встречает со своим эксцентричным другом-ученым по прозвищу Док, который представляет главному герою настоящую машину времени.',
    1985,
    3, 16, 116, 21
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Один дома',
    'Огромное семейство Маккалистеров собирается отправиться на Рождественские праздники в Париж. Как обычно это бывает, с утра оказывается, что они проспали, и все впопыхах начинают собираться. Им с большим трудом удается успеть на самолет, и когда тот уже взлетает, мать и отец восьмилетнего Кевина вспоминают, что они забыли своего младшего сына дома.',
    1990,
    3, 0, 103, 22
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    '1+1',
    'Филипп очень богатый человек, но в результате несчастного случая его парализовало, и он прикован к инвалидному креслу. Он потерял всякий интерес к жизни, и нуждается в постоянном присмотре. Для этих целей нанимаются сиделки, однако ни одна из них долго не работает. И вот однажды, очередной сиделкой Филиппа становится чернокожий молодой парень по имени Дрисса, вышедший совсем недавно из тюрьмы. Сложно представить такого человека в роли сиделки, однако парень умудряется найти общий язык с Филиппом.',
    2011,
    3, 18, 112, 23
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Полицейская академия',
    'Из-за нехватки полицейских мэр американского города объявляет об изменении правил набора в полицейскую академию: теперь туда может поступить любой желающий, независимо от религии, образования, а также физических и умственных способностей. Узнав об этом, в академию поступили сотни непохожих друг на друга людей, которые раньше и не мечтали оказаться в этом месте.',
    1984,
    3, 16, 93, 24
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Римские каникулы',
    'Действия замечательной романтической комедии разворачиваются в Риме, куда вместе со своей свитой прибывает юная и очень красивая европейская принцесса Анна.',
    1953,
    3, 6, 118, 25
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Час пик',
    'Если хотите весело провести время, то тогда фильм "Час пик" (Rush Hour) именно для вас. Сюжет, шутки, атмосфера и безусловно, непревзойденный дует Криса Такера и Джеки Чана - то, ради чего стоит его посмотреть.',
    1998,
    3, 12, 98, 26
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Не грози южному централу, попивая сок у себя в квартале',
    'Комедия «Не грози Южному Централу, попивая сок у себя в квартале» рассказывает нам об афроамериканце, которого прозвали "Пепельница". Для достижения зрелости он отправляется к своему отцу. В этом районе начинается все самое интересное.',
    1996,
    3, 18, 89, 27
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Такси',
    'Действие развивается в Марселе, Франция. Мечта Даниэля, обычного курьера пиццерии, наконец-то сбывается: он получает лицензию на работу в службе такси. Модифицировав служебный автомобиль, Даниэль начинает постоянно нарушать правила движения, стараясь быстрее доставить опаздывающих пассажиров. Очередной клиент такси — Эмильен — оказывается полицейским с бездарными навыками вождения автомобиля.',
    1998,
    3, 16, 86, 28
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Третий лишний',
    'Когда Джон Беннет был ребенком, он очень сильно любил своего плюшевого мишку Тедди. Он был его лучшим другом, и Джон всегда мечтал, чтобы тот ожил. И вот однажды случилось чудо, и плюшевый медвежонок заговорил.',
    2012,
    3, 18, 106, 29
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Маска',
    'Скромного и застенчивого работника банка Стенли Ипкисса никто не уважает, а он настолько закомплексован, что не может завести разговор с девушкой. После одно из самых ужасных дней на работе Стенли неожиданно находит маску Локи — скандинавского бога хитрости и обмана. Когда герой её надевает, то становится совершенно другим человеком — безумным и неуязвимым мультяшным существом.',
    1994,
    3, 12, 101, 30
);

/* Драмы */
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Форрест Гамп',
    'Картина снята по мотивам одноименного романа Уинстона Грума. Сюжет фильма рассказывает об увлекательной жизни парня по имени Форест Гамп.',
    1994,
    4, 12, 142, 31
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Гладиатор',
    'Действие фильма разворачивается в далеком 180 году нашей эры. Главный герой Максимус является одним из лучших генералов Римской Империи. Под его предводительством легионы повергли немало врагов, за что он стал любимчиком императора Марка Аврелия, и тот даже был готов передать ему свою власть, ведь родной сын Коммод, по мнению правителя, был недостоин трона. Узнав об этом, Коммод убивает отца, и тем самым берет власть над империей в свои руки. Максимус отказывается присягнуть новому правителю, и тот отдает приказ убить непокорного генерала.',
    2000,
    4, 16, 155, 32
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Зелёная книга',
    'Действие фильма, основанного на реальных событиях, разворачивается в 1962 году. Итало-американец Тони по кличке "Болтун" работает вышибалой в одном из престижных ночных клубов Бронкса. Когда заведение закрывается на ремонт, Тони решает найти временную работу, и вскоре у него появляется отличное предложение. Известный афроамериканский пианист Дон Ширли собирается в турне по южным штатам, и ему нужен хороший водитель и человек, способный решить в пути любую проблему, в одном лице.',
    2018,
    4, 16, 130, 33
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Интерстеллар',
    'В будущем климатические изменения привели к катастрофическому снижению урожайности и вымиранию самых распространенных сельскохозяйственных культур. Население страдает от голода и болезней на покрытой песком Земле, а бывший пилот Купер, как и большинство американцев, вынужден был бросить карьеру, чтобы заняться фермерством. Однажды его дочь Мёрфи пугается призрака в собственной спальне, оставившего ей закодированное сообщение.',
    2014,
    4, 16, 169, 34
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Леон',
    'Леон ведет тихий и спокойный образ жизни в одном из не самых лучших районов Нью-Йорка под названием Маленькая Италия. Никто даже представить себе не может, что этот человек самый настоящий наемный убийца. Однажды, находясь дома, Леон слышит шум, и, посмотрев в глазок своей двери, он становится свидетелем того, как всю семью, живущую в соседней квартире, убивают. Выжить удается только девочке-подростку Матильде, которой в то время не было дома. Она обращается к своему соседу Леону за помощью, ведь ей больше некуда идти.',
    1994,
    4, 18, 133, 35
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Список Шиндлера',
    'В основу сюжета картины лег роман Томаса Кенилли «Ковчег Шиндлера». Картина рассказывает о немецком бизнесмене, спасшем во время Второй Мировой войны не одну тысячу польских евреев.',
    1993,
    4, 16, 195, 36
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Крестный отец',
    'Культовая картина снята по одноименному роману американского писателя Марио Пьюзо. На дворе 1945 год. В центре сюжета сицилийская мафиозная семья Корлеоне, которая имеет жёсткие криминальные позиции в Нью-Йорке. Глава семейства Вито Корлеоне - очень известный и уважаемый человек в преступном мире, живущий по старым законам и традициям. Но время идет, времена меняются, и однажды Корлеоне предлагают отойти от его принципов, и заняться наркобизнесом.',
    1972,
    4, 18, 177, 37
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Зеленая миля',
    'Картина снята по одноименному роману Стивена Кинга. Однажды в блок для приговоренных к смертной казни поступает новый заключенный – Джон Коффи, осужденный за убийство маленьких девочек. Коффи привлекает внимание начальника этого блока – Пола Эджкомба. За долгие годы работы он насмотрелся на разных преступников, и он немного разбирается в людях. Пол сомневается в виновности Коффи, ведь несмотря на его устрашающий вид, он обладает добротой и человечностью. Так же со временем выясняется, что Джон является обладателем удивительного дара – способностью исцелять.',
    1999,
    4, 16, 189, 38
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Побег из Шоушенка',
    'В основу культовой драмы легла повесть Стивена Кинга «Рита Хейуорт из Шоушенка». Действие фильма разворачивается в конце 50-х годов прошлого столетия. Молодого финансиста Энди Дюфрейна за двойное убийство приговаривают к пожизненному заключению, но он категорически отрицает свою причастность к преступлению. Свой срок Энди отправляется отбывать в одну из известнейших тюрем – Шоушенк, из которой еще никому не удавалось сбежать.',
    1994,
    4, 16, 142, 39
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Одержимость',
    '19-летний Эндрю Ниман учится на первом курсе престижной консерватории Шаффера в Нью-Йорке, с детства играет на барабанах и мечтает прослыть музыкантом мирового уровня. Чтобы этого достичь, он записывается в оркестр знаменитого дирижера Теренса Флетчера на место заместителя основного барабанщика Карла Таннера, однако с первых же занятий становится жертвой безжалостного и требовательного характера маэстро.',
    2014,
    4, 16, 106, 40
);

/* Фэнтези */
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Эдвард руки-ножницы',
    'Действие фильма разворачивается в небольшом провинциальном городке. Пэг — представительница компании Avon, которая, не сумев отыскать новых клиентов, отправляется к мрачному замку, одиноко стоящему на холме, где встречает чудаковатого Эдварда с ножницами на руках.',
    1990,
    5, 12, 105, 41
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Пираты Карибского моря: Проклятие Черной жемчужины',
    'Пиратское судно «Черная жемчужина» совершает дерзкое нападение на Порт-Ройал, похищая, среди прочего, дочь губернатора. В погоню за морскими авантюристами отправляется Уилл Тернер, друг детства девушки, вынужденный заключить временный союз с бывшим капитаном Жемчужины - пиратом Джеком Воробьем. Захватив самый быстрый корабль Британии, они начинают опасное путешествие, не подозревая, какие невероятные приключения ждут их впереди.',
    2003,
    5, 12, 143, 42
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Пираты Карибского моря: Сундук мертвеца',
    'Джек Воробей оказывается в потустороннем мире, где он узнает, что должник Дэйви Джонса – капитана легендарного «Летучего Голландца», и после своей смерти он будет обязан служить вечно в его команде. Пирату не по себе от такой мысли, и ему нужно как можно быстрее решить эту проблему. Чтобы избавиться от проклятия Джек отправляется в очередное плавание, на поиски сердца Джонса, спрятанного в сундуке на одном из островов.',
    2006,
    5, 12, 144, 43
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Пираты Карибского моря: На краю Света',
    'Лорд Беккет с помощью Дэйви Джонса, капитана «Летучего голландца», безжалостно уничтожает пиратов. Джонс вынужден ему помогать, ведь его сердце находится в руках у Беккета. Тем временем Джек Воробей находится в ловушке на краю света. Уилл и Элизабет объединяются с самым заклятым врагом Джека – капитаном Барбоссой в одну команду.',
    2007,
    5, 12, 169, 44
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Хоббит: Нежданное путешествие',
    'Бильбо Бэггинс, готовящийся отметить 111-й день рождения, пишет книгу о своих приключениях 60-летней давности и уходит в воспоминания. Рассказ начинается с того, как хоббит, ни разу не покидавший родные земли, поддается на уговоры своего старого приятеля Гэндльфа Серого, отправиться в путешествие с 13-ю гномами во главе с Торином Дубощитом, которые держат путь в Эребор, откуда их когда-то давно изгнал огнедышащий дракон Смауг.',
    2012,
    5, 12, 182, 45
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Хоббит: Пустошь Смауга',
    'Приключенческая фэнтези драма, вышедшая на экраны в 2013 году, «Хоббит: Пустошь Смауга» - это вторая часть из трилогии «Хоббит», в основе сюжета которой лежит повесть-сказка английского писателя Джона Толкина «Хоббит, или Туда и обратно».',
    2013,
    5, 12, 187, 46
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Хоббит: Битва пяти воинств',
    'Действие разворачивается возле Одинокой горы, скрывающей несметные сокровища гномов. К горе отправился отряд гномов, который нанял хоббита Бильбо Бэгинса. Гномов было тринадцать, а Бильбо был нанят не только в качестве взломщика, ведь он стал четырнадцатым, а значит «счастливым» участником экспедиции.',
    2014,
    5, 12, 144, 47
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Властелин колец: Братство кольца',
    'Приключенческая картина является первой частью кинотрилогии, снятой по роману известного английского писателя Джона Рональда Руэл Толкина «Властелин колец».',
    2001,
    5, 12, 228, 48
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Властелин колец: Две крепости',
    'Приключенческий фильм, вышедший на экраны в 2002 году – это вторая часть кинотрилогии, снятой по роману известного английского писателя Джона Рональда Руэл Толкина «Властелин колец».',
    2002,
    5, 12, 236, 49
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Властелин колец: Возвращение Короля',
    'Приключенческий фильм «Властелин колец: Возвращение Короля» - это заключительная часть трилогии, снятой новозеландским режиссером Питером Джексоном по роману известного английского писателя Дж. Р. Р. Толкина «Властелин колец».',
    2003,
    5, 12, 263, 50
);

/* Приключения */
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Изгой',
    'Главный герой Чак Нолан на протяжении долгих лет работает в почтовой службе доставки «Федерал Экспресс». Он занимает очень высокий пост в компании, скрупулёзно и ответственно относясь к своей работе. Весь его рабочий день расписан буквально поминутно, и он практически не видится с любимой женщиной. Однажды, отправившись сопровождать груз, Чак попадает в авиакатастрофу, в результате которой оказывается на необитаемом острове.',
    2000,
    6, 12, 143, 51
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Танцующий с волками',
    'Действие картины разворачивается в самый разгар Гражданской войны в США. Главный герой фильма – молодой лейтенант американской армии по имени Джон Данбар. Однажды во время боя он получает ранение, после чего просит командование перевести его на другое место службы.',
    1990,
    6, 16, 236, 52
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Динотопия',
    'Сводные братья Карл и Дэвид, а также их отец Фрэнк, летят на легком одномоторном самолете над океаном, попадают в шторм и совершают аварийную посадку на воду. Из бушующей морской стихии удается спастись лишь двум подросткам, которые выбираются на сушу таинственного острова Динотопия, где перемешалось множество культур, а люди и динозавры живут в мире и согласии.',
    2002,
    6, 0, 85, 53
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Индиана Джонс: В поисках утраченного ковчега',
    'Действие картины разворачивается в 1936 году. Главного героя фильма – профессора археологии Индиану Джонса, преподающего в одном из университетов штата Нью-Джерси, навещает пара агентов, работающих на военную разведку США. Они сообщают Джонсу, что подозревают его наставника Абнера Рэйвенвуда в пособничестве нацистам, которые заняты поисками древнего города Танис, в котором, по их мнению, находится "Ковчег Завета".',
    1981,
    6, 12, 115, 54
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Индиана Джонс и Храм судьбы',
    'После того, как профессору Джонсу, вместе со своим помощником Коротышкой, а так же певицей по имени Уилли Скотт, удалось уйти от преследования очень опасного шанхайского преступника, они все вместе отправляются ни куда, нибудь, а в самое сердце гималайских гор. Прибыв на место, компания оказывается в небольшой индийской деревушке. Пообщавшись с местными жителями, Джонс узнает, что совсем недавно у тех украли священную реликвию, и решает им помочь в поисках святыни.',
    1984,
    6, 12, 118, 55
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Индиана Джонс и последний крестовый поход',
    'Действия фильма разворачиваются в 1938 году. Некий бизнесмен Уолтер Донован сообщает герою, что у него есть каменная табличка способная дать подсказку, где искать Святой Грааль. Вот только оказывается, что она серьезно повреждена, и чтобы ее прочесть придётся немного постараться. К счастью, как раз в это самое время, в руки Джонса попадает дневник его отца, который также археолог и просто был помешан на поисках того самого Святого Грааля.',
    1989,
    6, 12, 127, 56
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Шанхайские рыцари',
    'Фильм "Шанхайские рыцари" (Shanghai Knights) представит вам уже полюбившихся героев Роя Баннона и Чона Ванга. Они опять в седле и готовы приступить к решительным действиям. На этот раз местом действия, где развернулась картина, становится вовсе не Дикий Запад, а классический и элегантный Лондон со всеми вытекающими из этого последствиями.',
    2003,
    6, 12, 114, 57
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Маска Зорро',
    'В начале XIX века в Калифорнии таинственный Зорро был главным борцом против безжалостного тирана — губернатора Монтеро. Накануне освобождения штата от тирании чиновника, Зорро оказывается рассекречен Монтеро, который нападает на его дом, убивает жену, похищает дочь, а главный герой оказывается в заточении.',
    1998,
    6, 12, 136, 58
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Мумия',
    'ействие картины разворачивается в 1923 году на необъятных просторах пустыни Египта, куда компания черных археологов из Англии и Америки отправляется в поисках клада, над которым висит страшное древнее проклятие. Во время экспедиции искатели приключений находят в развалинах Хамунаптры гробницу, вследствие взлома которой они тревожат вечный сон лысого жреца, тело которого было заживо мумифицировано и помещено в саркофаг стражей фараона. И тут, спустя столетия ему предоставляется уникальная возможность выйти на волю и завершить все ранее начатые дела.',
    1999,
    6, 12, 124, 59
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Сокровище Амазонки',
    'События происходят в далеких джунглях дикой Амазонки, куда прибыл наемный солдат, для поисков пропавшего сына своего заказчика. Потерянный быстро находится и рассказывает о том, что где-то глубоко в джунглях спрятаны несметные богатства Эльдорадо. Они решают временно объединится для поисков древнего сокровища.',
    2003,
    6, 12, 104, 60
);

/* Детективы */
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Основной инстинкт',
    'Ник Каррене работает в полиции. Он занимается расследованием убийства Джонни Боза – бывшей рок-звезды, который был убит прямо у себя в постели.',
    1992,
    7, 18, 128, 61
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Помни',
    'Главный герой фильма - Леонард Шелби. Он ценит дорогую изысканную одежду, ездит на новеньком блестящем "Ягуаре", но ночевать предпочитает в недорогих гостиницах. Эта странность объясняется его жизненными целями: он жаждет мести. Поискам убийц своей жены посвящены все его действия и мысли, но его заболевание серьезно тормозит процесс. Дело в том, что вследствие черепно-мозговой травмы у Леонарда развилась редкая форма амнезии: каждые десять минут его память стирает события, которые произошли за это время.',
    2000,
    7, 16, 113, 62
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Психо',
    'В основу сюжета картины лег одноименный роман американского фантаста Роберта Блоха. Сюжет разворачивается вокруг молодой и привлекательной женщины Мэрион Крэйн. Однажды начальник доверяет ей довольную крупную сумму денег, в размере сорока тысяч долларов. Недолго думая, Мэрион крадет эти деньги, ведь она уже давно мечтает покинуть родной город и начать совершенно новую жизнь, а тут такой шанс.',
    1960,
    7, 16, 109, 63
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Семь',
    'Детектив Уильям Сомерсет много лет своей жизни отдал работе в полиции, и вот вскоре он должен выйти на пенсию. Однако буквально за несколько дней до этого события в городе начинает орудовать жестокий серийный убийца, на счету которого уже две смерти. Это дело поручают Сомерсету, а в напарники ему дают молодого и неопытного парня Миллза. Опытный детектив сразу же приходит к выводу, что это только начало, и будут новые жертвы.',
    1995,
    7, 18, 127, 64
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Шерлок Холмс',
    'Лондон, 1890 год. В городе совершено пять ритуальных убийств, и вот-вот должно произойти еще одно. Но великому детективу Шерлоку Холмсу и его верному другу и помощнику доктору Ватсону удается предотвратить преступление, и поймать убийцу, которым оказывается лорд Блэквуду. Его приговаривают к смертной казни через повешение. Однако через несколько дней, после исполнения приговора, Холмсу сообщают, что лорд воскрес из мертвых.',
    2009,
    7, 12, 128, 65
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Остров проклятых',
    'Действие картины разворачивается в 1954 году в США. Федеральный маршал Тедди Дениелс вместе со своим напарником Чаком Оулом отправляется на закрытый остров Шаттер, для расследования произошедшего там побега. На территории острова находится засекреченная и хорошо охраняемая клиника, в которой отбывают заключение самые буйные и непредсказуемые душевнобольные. Одному из них, а именно Рэйчел Соландо – убийце родных детей, каким-то удивительным образом удалось сбежать прямо из закрытой палаты.',
    2010,
    7, 16, 138, 66
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Сонная Лощина',
    'Детективный фильм ужасов является вольной экранизацией известной новеллы «Легенда о Сонной лощине», написанной Вашингтоном Ирвингом.',
    1999,
    7, 18, 105, 67
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Отступники',
    'В центре сюжета картины двое полицейских, один из которых Колин Салливан работает на мафию, а второй Билли Костиган был внедрен в ряды мафиозной группировки, чтобы выявить крота. Когда-то давно они оба окончили полицейскую академию, и были лучшими выпускниками, однако судьба злодейка распорядилась так, что теперь парни по разные стороны баррикад. Билли пришлось отсидеть реальный срок, чтобы внедриться в мафию, и теперь он делает все, чтобы выявить стукача, но пока тщетно.',
    2006,
    7, 16, 151, 68
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Адвокат дьявола',
    'Кевин Ломакс — непобедимый адвокат из Флориды. Работая над защитой учителя в судебном разбирательстве, обвиняемого в растлении малолетних, адвокат начинает подозревать, что его подопечный действительно виновен, однако он выигрывает дело, несмотря на муки совести. Это дело привлекает к нему внимание одной из ведущих юридических фирм Нью-Йорка, и Кевин получает предложение о работе.',
    1997,
    7, 16, 144, 69
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Иллюзионист',
    'В основу сюжета картины легла новелла американского писателя и сценариста Стивена Миллхаузера. Действия картины разворачиваются в начале ХХ века в Вене. В это время город потрясает своими выступлениями известный иллюзионист Айзенхайм. Он настолько шокирует своими фокусами зрителей, что многие из них начинают допускать мысль, что иллюзионисту подвластна настоящая магия. Айзенхайм родился в семье столяра, и уже с раннего детства увлекался фокусами.',
    2006,
    7, 16, 109, 70
);

/* Биографические */
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Али',
    'Фильм "Али" (Ali) - это фильм не просто о боксе. Это фильм о жизни великого человека Мохаммеда Али, жившего во времена кризиса военной политики США, расовых волнений и столкновений моральных принципов. Его жизнь была яркой и насыщенной. Он человек со своим мнением, готовый всегда идти до конца, как в бою, так и в жизни.',
    2001,
    8, 16, 165, 71
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'В погоне за тенью',
    'Фильм За пределами закона (Beyond the Law) на первый взгляд обычный криминальный фильм, которых в 90-е годы наштамповали много, но данный сюжет не просто вымысел сценариста, ведь он основан на реальных событиях. Более того, полицейского с которого срисовали ключевого персонажа, пригласили сыграть эпизодическую роль. Главному герою, по имени Дэн предстоит втереться в доверие к банде байкеров, чтобы иметь возможность отследить крупнейшую операцию, связанную с наркотиками. Однако, заслужить респект не так то просто.',
    1993,
    8, 18, 108, 72
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Поймай меня, если сможешь',
    'Криминальная драма рассказывает о реальных событиях из жизни Фрэнка Эбигнейла – одного из самых легендарных мошенников.',
    2002,
    8, 12, 141, 73
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Далласский клуб покупателей',
    'Главный герой фильма – парень по имени Рон Вудруф, живущий в штате Техас. Он работает электриком и ведет размеренный образ жизни. Но однажды на работе происходит несчастный случай, и Рон оказывается в больнице. Там герою ставят очень неутешительный диагноз – СПИД, и сообщают, что жить ему осталось не более двух месяцев. Однако Рон наотрез отказывается мириться с такого рода смертельным приговором, и принимает решение самостоятельно бороться с болезнью.',
    2013,
    8, 18, 118, 74
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'По соображениям совести',
    'Десмонд Досс – молодой американский паренёк, проживающий вместе со своим отцом, ветераном Первой мировой, в небольшом провинциальном городке. С ранних лет воспитываясь в соответствии с принципами адвентистов седьмого дня, парень как никто иной понимал, что война, оставшаяся позади, так легко не сдаётся – она возвращается в людские дома в сердцах ветеранов, которые чудом остались в живых, пройдя через ужасы кровопролитных боевых действий.',
    2016,
    8, 18, 139, 75
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Наполеон',
    'История стремительного и безжалостного восхождения Наполеона Бонапарта к титулу императора, рассматриваемое через призму его захватывающих и часто изменчивых отношений с женой и единственной настоящей любовью — Жозефиной.',
    2023,
    8, 18, 150, 76
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Банда Келли',
    'События киноленты происходят в Австралии на закате 19 века. В центре сюжета простой подросток по имени Нед из малоимущей ирландской семьи, который попадает по ложному обвинению за решетку. Три года он оказывается заперт в тюрьме, и поневоле в нем вскипает ненависть к полиции, которая жестоко ведет себя с ирландцами и калечит заключенных. Узнав, что его мать задержана полицией, Нед приходит в ярость, и решает сколотить вместе с братом и друзьями свою банду.',
    2003,
    8, 16, 110, 77
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Оппенгеймер',
    'В разгар Второй мировой войны полковник США Лесли Гровс назначает блестящего физика-теоретика Роберта Оппенгеймера научным руководителем Манхэттенского проекта. Вся индустриальная мощь и инновационные технологии страны идут на то, чтобы опередить нацистскую Германию в создании оружия массового поражения на основе расщепления ядра атома.',
    2023,
    8, 18, 180, 78
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Социальная сеть',
    'Кинофильм "Социальная сеть" был создан в 2010 году лучшими американскими кинематографистами. Режиссером этой увлекательной биографической драмы стал Дэвид Финчер. Он экранизировал интереснейшую историю о самом молодом в мире миллиардере, который разбогател всего лишь в 30 лет.',
    2010,
    8, 12, 120, 79
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Волк с Уолл-стрит',
    'В конце 80-х годов Белфорт открывает свою собственную брокерскую контору и очень быстро зарабатывает огромное состояние. Он с головой погружается в роскошную жизнь, и на протяжении долго периода времени ведет беззаботный образ жизни. Белфорт стал одним из тех, кого назвали «элита Уолл-стрит», но ему было этого мало, он жаждал чего-то более масштабного. Однако рано или поздно все хорошее заканчивается. Именно такая участь постигла и гениального брокера.',
    2013,
    8, 18, 180, 80
);

/* Триллеры */
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Время убивать',
    'Сюжет фильма "Время убивать" (A Time to Kill) завязывается после совершения ужаснейшего преступления: маленькая десятилетняя девочка была жестоко изнасилована несколькими правонарушителями. Но неожиданно, однако при этом соблюдая все законы, преступники были отпущены судом под залог. Подавленный этим случаем, её отец осмеливается самостоятельно отомстить маньякам. Отчаявшийся мужчина расстреливает бандитов, из-за чего сам оказывается в тюрьме.',
    1996,
    9, 16, 150, 81
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Славные парни',
    'Нью-Йорк, 1950-е годы. В центре сюжета амбициозный паренек Генри Хилл, живущий в неблагополучном районе Бруклин, который постепенно становится частью преступного мира мегаполиса. Его лучший друг Томми ДеВито — жестокий и неуравновешенный бандит, легко расправляющийся с собственными врагами и заслуживший репутацию дерзкого головореза.',
    1990,
    9, 16, 146, 82
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Джокер',
    'События развиваются в начале 1980-х годов вокруг невезучего стендап-комика Артура Флека, который живет вместе с больной матерью в небольшой квартире в Готэм-сити и страдает от редкого психического заболевания, вызывающего у него приступы неконтролируемого смеха. Когда ведущий популярного вечернего ток-шоу Мюррей Франклин публично высмеивает Флека на телевидении, а мать попадает в больницу, он больше не находит сил веселить публику своими выступлениями. Нанеся безобразный грим на лицо и взяв псевдоним Джокер, мужчина ставит перед собой новую цель: заставить страдать всех вокруг...',
    2019,
    9, 18, 122, 83
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Законопослушный гражданин',
    'Клайд Шелтон ведет тихий и спокойный образ жизни. Он хороший муж, любящий отец, и просто порядочный человек, уважающий закон. Но однажды все меняется, после того как в дом героя врываются двое грабителей, один из которых убивает его жену и совсем юную дочь. Преступников арестовывают, однако получается так, что против них оказывается мало доказательств, и поэтому помощник окружного прокурора Ник Райс заключает с одним из них сделку. В результате чего, Эймс, который никого не убивал, получает высшую меру наказания, а Дарби, лишивший Клайда семьи, отделывается лишь несколькими годами тюремного заключения.',
    2009,
    9, 18, 108, 84
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Бешеные псы',
    'Криминальный босс Джо Кэбот собирает в ресторане шестерых профессиональных преступников и для конспирации дает им псевдонимы, обозначающие цвет. Вскоре после этого они отправляются штурмовать ювелирный магазин, но попадают в спланированную полицейскую засаду, которая дает основания предполагать, что среди них есть предатель. В результате двое гибнут, а Мистер Оранжевый получает серьезное ранение в живот. Оставшиеся в живых укрываются на заброшенном складе, намереваясь вычислить среди своих сообщника полиции.',
    1992,
    9, 18, 100, 85
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Заложница',
    'Брайан Миллс – бывший секретный агент ЦРУ. Теперь он подрабатывает охраной и сопровождением VIP персон. Однажды его дочь вместе с подругой едет отдыхать в Париж. По приезду девушек похищают неизвестные. Узнав об этом, Миллс не раздумывая решает сам отправиться на поиски своего чада. Используя связи и навыки, приобретенные во время работы в ЦРУ, ему удается выйти на след похитителей. То, что он узнает в ходе расследования, повергает Миллса в ужас: если он в ближайшее время не найдет свою дочь, то она попадет в сексуальное рабство, ведь к похищению причастны торговцы людьми.',
    2008,
    9, 16, 93, 86
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Телохранитель',
    'Настоящий профессионал-телохранитель уверяет сам себя в том, что именно он виноват в совершённом покушении на президента. Он должен быть тогда возле президента и тогда ничего не случилось бы. Такие мысли преследуют Фрэнка Фармера в фильме «Телохранитель» (The Bodyguard). Профессиональный работник спецслужб не находит иного выхода, как уйти со службы. Он устраивается на частную работу к темнокожей звезде-певице Рэйчел Мэррон. Гонорар хоть и приличный, но разбалованная звезда не прислушивается к инструкциям и предостережениям, что делает её охрану крайне сложным делом.',
    1992,
    9, 16, 129, 87
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Ворон',
    'События разворачиваются вокруг рок-музыканта Эрика Дрэйвена, который живет вместе со своей любимой девушкой Шелли и готовится к празднованию Хэллоуина. Но его планы рушатся, когда банда убийц и насильников внезапно врывается в дом главного героя, жестоко расправляется сначала с его подругой, а затем и с Эриком, однако они еще даже не подозревают, чем это обернется. Спустя год, проведенный во тьме, в эту же самую ночь, Дрэйвен поднимается из своей могилы, чтобы отправиться на поиски убийц, сломавших его жизнь, и обрушить на них свою месть.',
    1994,
    9, 18, 102, 88
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Линкольн для адвоката',
    'Микки Холера довольно успешный адвокат, который всю свою жизнь тем и занимается, что защищает мелких преступников. Его дом и офис - это автомобиль Линкольн, на котором Микки ездит по городу от одного клиента к другому. Он принимает в машине всех клиентов, и там же хранит все свои бумаги. Но однажды судьба улыбается Микки, ему подворачивается дело, которое можно назвать делом всей его адвокатской жизни. К главному герою за защитой обращается состоятельный клиент, которого обвиняют в нападении на проститутку. Но Микки даже не мог себе представить, во что выльется его новое дело...',
    2011,
    9, 16, 114, 89
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Молчание ягнят',
    'На Среднем Западе США бесчинствует серийный маньяк. Он похищает женщин, а после того как убивает, сдирает с них кожу, за что его прозвали «Буффало Билл». ФБР делает все возможное, чтобы остановить преступника, однако им не удается найти ни одной зацепки, которая помогла бы выйти на его след. В свете сложившейся ситуации, они решают обратиться за помощью к опасному убийце Ганнибалу Лектеру, ныне отбывающему заключение в одной из психиатрических больниц. К этому делу привлекают молодую стажёрку Кларису Старлинг. Лектер соглашается помочь, но только при одном условии: девушка должна посвятить его в подробности своей жизни.',
    1992,
    9, 18, 114, 90
);

/* Боевики */
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Драйв',
    'Действие разворачивается вокруг Водителя, который днем управляет автомобилями, принимающими участие в съемках фильмов, а ночью предоставляет свои услуги преступникам, нуждающимся в машинах для криминальной деятельности. Несмотря на опасную работу, он ведет тихий и простой образ жизни, пока не встречает симпатичную соседку Айрин и ее маленького сына Бенисио. Когда супруга Айрин освобождают из тюрьмы, Водитель неохотно соглашается помочь ему с работой, которая избавит мужчину от долгов и неприятностей.',
    2011,
    10, 18, 100, 91
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Бесславные ублюдки',
    'В 1941 году немецкий офицер Ганс Ланда, имеющий прозвище «Охотник за евреями», наведался на молочную ферму француза Перье Лападитта, где скрывалось семейство Дрейфусов. Расстреляв всех членов еврейской семьи, он позволил сбежать 18-летней Шошанне, держа ее на мушке пистолета до самого горизонта.',
    2009,
    10, 18, 153, 92
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Джек Ричер',
    'Когда неизвестный снайпер убивает пять невинных человек на улице, полиция задерживает подозреваемого, на которого указывают все улики. Но на допросах этот человек ничего не говорит, и лишь только просит найти Джека Ричера, бывшего специального агента, прошедшего через большое количество горячих точек. Правда найти его не так уж и просто, ведь он этого не хочет, и ведет себя как призрак. Но этого и не нужно делать, он сам выходит на полицейских. Джек берется за это дело, однако разобраться в этой странной истории оказывается не так просто…',
    2012,
    10, 16, 130, 93
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Джон Уик',
    'Главный герой Джон Уик в прошлом наемный убийца, настоящий профессионал своего дела. На его счету не один десяток жертв, однако теперь он завязал, и пытается вести нормальный образ жизни. Джон из-за болезни потерял жену, и единственная радость для него - это маленький щенок, который стал посмертным подарком возлюбленной. Но однажды происходит событие, которое заставляет его снова взять оружие в руки и прибегнуть к насилию.',
    2014,
    10, 16, 101, 94
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Дом у дороги',
    'Вышибала Далтон приезжает в провинциальный бар, где сталкивается с местной бандой. Ремейк одноименного фильма 1989 года.',
    2024,
    10, 18, 123, 95
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Рок-н-рольщик',
    'Действия разворачиваются в Лондоне. С помощь местного криминального авторитета Ленни Коула, один очень богатый русский Юрий Омович пытается получить разрешение на строительство стадиона. За это он обещает Ленни семь миллионов долларов, а так же во временное пользование свою любимую картину, которая по его словам приносит удачу. Вот только кроме самого Коула, на кругленькую сумму денег сразу же находятся еще желающие. Во время перевозки денег на машину нападает бандит по кличке Раз-Два, которого нанимает бухгалтер самого же Омовича Стелла.',
    2008,
    10, 16, 114, 96
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Стрелок',
    'В центре сюжета картины профессиональный снайпер по имени Боб Ли Суэггер, который много лет отдал службе в американской армии. Но после того, как во время выполнения очередной секретной операции погиб напарник и друг Бобби, он раз и навсегда решил завязать со службой, и теперь ведет тихий и спокойный образ жизни. Но однажды прошлое напоминает о себе: за помощью к отставному военному обращаются из секретной службы. Они сообщают Бобби, что на главу государства готовится покушение, а он один из немногих, кто способен помочь его предотвратить.',
    2007,
    10, 16, 124, 97
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Большой куш',
    'В результате ограбления группе воров удается выкрасть один из самых больших и дорогостоящих бриллиантов в мире. Четырехпалому Френки предстоит переправить украденный камень своему боссу в США. Однако кража такой вещицы не могла не привлечь постороннего внимания, и прознавшие об этом деле криминальные элементы, так же не прочь поживиться. Посетив подпольный боксерский поединок, и сделав там ставку, Френки с головой погружается в омут негативных событий. Вокруг героя разворачиваются самые настоящие интриги, в которых принимают участие самые разнообразные персонажи, и каждый из них мечтает сорвать «большой куш».',
    2000,
    10, 16, 102, 98
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Джентльмены',
    'Микки Пирсон родился и вырос в США в бедной семье, однако смог получить стипендию Родса и поступить в Оксфордский университет, где начал продавать марихуану своим сокурсникам. В скором времени учеба отошла на второй план, а Микки сосредоточился на развитии подпольного бизнеса по выращиванию и продаже травки, достигнув в итоге невероятных успехов. Став одной из самых влиятельных фигур Великобритании, он через некоторое время решает продать прибыльный бизнес, оценив его в 400 миллионов фунтов, но неожиданно сталкивается с серьезными проблемами...',
    2019,
    10, 18, 113, 99
);
insert into films(
    "name", description, "year",
    genre_id, minimal_age,
    duration_in_minutes, file_id
) values (
    'Троя',
    'Историческая драма «Троя» снята немецким кинорежиссером Вольфгангом Петерсеном по мотивам древнегреческого произведения «Илиада», которое освещает события Троянской войны.',
    2004,
    10, 18, 196, 100
);